---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs
source: html/d5a89d6c-e890-c0a0-d1ab-0185ecbbfbd6.htm
---
# LinkedResourceOpeningEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.